УТ/src/Catalogs/CRM_Диалоги/CRM_Диалоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_Диалоги</name>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>ID_Пользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.CRM_ЭтапКалендарногоПлана</types>
      <types>DocumentRef.CRM_Интерес</types>
      <types>DocumentRef.CRM_РассылкаЭлектронныхПисем</types>
      <types>DocumentRef.CRM_Взаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.CRM_УстановкаИспользуемыхПоказателей</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.CRM_Телемаркетинг</types>
      <types>DocumentRef.СогласиеНаОбработкуПерсональныхДанных</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.СправкиСПАРКРиски</types>
      <types>DocumentRef.Встреча</types>
      <types>DocumentRef.ОтзывСогласияНаОбработкуПерсональныхДанных</types>
      <types>CatalogRef.Партнеры</types>
      <types>DocumentRef.Анкета</types>
      <types>DocumentRef.НазначениеОпросов</types>
      <types>DocumentRef.КоммерческоеПредложениеКлиенту</types>
      <types>DocumentRef.СообщениеSMS</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>DocumentRef.CRM_ПланированиеВоронкиПродаж</types>
      <types>DocumentRef.CRM_ОтчетОРаботе</types>
      <types>DocumentRef.CRM_ОтсутствиеСотрудника</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
      <types>DocumentRef.CRM_ШаблонЭтапаКалендарногоПлана</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.CRM_СтатусыДиалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействияСДиалогом</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.CRM_ДействияСДиалогами</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектДействия</name>
      <type>
        <types>DocumentRef.CRM_Интерес</types>
        <types>TaskRef.ЗадачаИсполнителя</types>
        <types>CatalogRef.Пользователи</types>
        <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_Диалоги/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
			ДатаНачала = ТекущаяДатаСеанса();
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Автор) Тогда
			Автор = Пользователи.ТекущийПользователь();
		КонецЕсли;
		Статус = Перечисления.CRM_СтатусыДиалогов.Новый;
	Иначе
		Если ПометкаУдаления И Не Завершен Тогда
			Статус = Перечисления.CRM_СтатусыДиалогов.Закрыт;
			Справочники.CRM_Диалоги.ДобавитьДействие(
				ЭтотОбъект, Перечисления.CRM_ДействияСДиалогами.ЗавершенАвтоматически);
		КонецЕсли;
		
		Если Статус = Перечисления.CRM_СтатусыДиалогов.Закрыт И Статус <> Ссылка.Статус Тогда
			Если Не ЗначениеЗаполнено(ДатаЗавершения) Тогда
				ДатаЗавершения = ТекущаяДатаСеанса();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Ответственный) Тогда
				Ответственный = Пользователи.ТекущийПользователь();
			КонецЕсли;
			Если Не Завершен Тогда
				Завершен = Истина;
			КонецЕсли;
		ИначеЕсли Статус = Перечисления.CRM_СтатусыДиалогов.ПринятВРаботу И Статус <> ссылка.Статус Тогда
			Если Не ЗначениеЗаполнено(ДатаПринятия) Тогда
				ДатаПринятия = ТекущаяДатаСеанса();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Ответственный) Тогда
				Ответственный = Пользователи.ТекущийПользователь();
			КонецЕсли;
		ИначеЕсли Статус = Перечисления.CRM_СтатусыДиалогов.ПереданДляОзнакомления Тогда
			
		Иначе
			Если (ЗначениеЗаполнено(Ответственный) И Ответственный <> Ссылка.Ответственный)
				Или (Не ЗначениеЗаполнено(Ответственный) И ЗначениеЗаполнено(Ссылка.Ответственный)
					 И ЗначениеЗаполнено(CRM_РольОтветственного)) Тогда
				Статус = Перечисления.CRM_СтатусыДиалогов.ВозвращенВОчередь;
				НовДействие = ДействияСДиалогом.Добавить();
				НовДействие.Дата = ТекущаяДатаСеанса();
				НовДействие.Действие = Перечисления.CRM_ДействияСДиалогами.ВозвращенВОчередь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	CRM_КлиентыСервер.ПередЗаписьюОбъектаОбщегоЖурнала(ЭтотОбъект, Отказ, Неопределено, Неопределено);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	ДатаНачала = ТекущаяДатаСеанса();
	ДатаПринятия = ТекущаяДатаСеанса();
	ДатаЗавершения = Дата(1, 1, 1);
	Завершен = Ложь;
	Наименование = "";
	ДействияСДиалогом.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли
